# *READ CSV*

In [2]:
import pandas as pd

# Upload CSV and separate with ";"

file_path = "C:/Users/gabri/OneDrive/Documentos/Universidad/ETL/workshop/csv/candidates.csv"
df = pd.read_csv(file_path, sep=";")

# Show info

df.head()

,First Name,Last Name,Email,Application Date,Country,YOE,Seniority,Technology,Code Challenge Score,Technical Interview Score
0,Bernadette,Langworth,leonard91@yahoo.com,2021-02-26,Norway,2,Intern,Data Engineer,3,3
1,Camryn,Reynolds,zelda56@hotmail.com,2021-09-09,Panama,10,Intern,Data Engineer,2,10
2,Larue,Spinka,okey_schultz41@gmail.com,2020-04-14,Belarus,4,Mid-Level,Client Success,10,9
3,Arch,Spinka,elvera_kulas@yahoo.com,2020-10-01,Eritrea,25,Trainee,QA Manual,7,1
4,Larue,Altenwerth,minnie.gislason@gmail.com,2020-05-20,Myanmar,13,Mid-Level,Social Media Community Management,9,7

This dataset contains information about candidates who participated in hiring processes. Each row represents a candidate and includes the following columns:

+ First Name & Last Name: Candidate's first and last name.
+ Email: Candidate's email address.
+ Application Date: Date when the candidate applied.
+ Country: Candidate’s country of origin.
+ YOE (Years of Experience): Candidate’s years of experience.
+ Seniority: Candidate’s experience level or job title (Intern, Mid-Level, etc.).
+ Technology: Candidate’s area of expertise in technology.
+ Code Challenge Score: Score obtained in the coding test.
+ Technical Interview Score: Score obtained in the technical interview.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   First Name                 50000 non-null  object
 1   Last Name                  50000 non-null  object
 2   Email                      50000 non-null  object
 3   Application Date           50000 non-null  object
 4   Country                    50000 non-null  object
 5   YOE                        50000 non-null  int64
 6   Seniority                  50000 non-null  object
 7   Technology                 50000 non-null  object
 8   Code Challenge Score       50000 non-null  int64
 9   Technical Interview Score  50000 non-null  int64
dtypes: int64(3), object(7)
memory usage: 3.8+ MB

The data types are 10, 7 objects (string) and 3 int (Integer)

In [9]:
print(df.isnull().sum())

First Name                   0
Last Name                    0
Email                        0
Application Date             0
Country                      0
YOE                          0
Seniority                    0
Technology                   0
Code Challenge Score         0
Technical Interview Score    0
dtype: int64

Don't exist null entries, ALL raws have 50.000 values

## Show unique values for columns

In [12]:
df.nunique()

First Name                    3007
Last Name                      474
Email                        49833
Application Date              1646
Country                        244
YOE                             31
Seniority                        7
Technology                      24
Code Challenge Score            11
Technical Interview Score       11
dtype: int64

### Show duplicate rows

In [13]:
df.duplicated().sum()

np.int64(0)

Don't exists duplicate rows

In [3]:
max_values = df.max()
print(max_values)

First Name                                        Zula
Last Name                                       Zulauf
Email                        zula_weissnat@hotmail.com
Application Date                            2022-07-04
Country                                       Zimbabwe
YOE                                                 30
Seniority                                      Trainee
Technology                           Technical Writing
Code Challenge Score                                10
Technical Interview Score                           10
dtype: object

The max values are corrects.

In [6]:
df["Seniority"].unique()

array(['Intern', 'Mid-Level', 'Trainee', 'Junior', 'Lead', 'Architect',
       'Senior'], dtype=object)

Seniority have 7 unique values